{"success":true,"data":[{"id":462966,"post_id":null,"hash":"bqzkunxgwyih","title":"متد i","body":"<p class=\"md-block-unstyled\">امروز حین شکار یه باگ به یه متد عجیب برخورد کردم. متدی به اسم i، سعی کردم تاریخچه به وجود اومدنش رو بررسی کنم. <\/p>","force_drafted":false,"updated_at":"۳ هفته پیش"},{"id":402441,"post_id":134596,"hash":"pmp8ssuzdrmi","title":"باگ را بدون باگ گزارش کنید","body":"<figure class=\"md-block-image\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/pmp8ssuzdrmi\/lekcmhjj7tkl.jpeg\" alt=\"\" \/><\/figure><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">این پست را قبلا در سایت لینوکس ریویو منتشر کرده بودم که به رحمت ایزدی پیوست. امید که اینجا ماندگارتر بماند. متاسفانه منبع انگلیسی آن را پیدا نکردم.<\/p><h3 class=\"md-block-header-three\">مقدمه<\/h3><p class=\"md-block-unstyled\">هر کسی که برنامه‌ای نوشته باشد به احتمال زیاد حداقل یک «گزارش باگ» دریافت می‌کند. گزارش‌هایی که اطلاعاتی نمی‌دهند «این کار نمی‌کند!»؛ گزارش‌هایی که بی‌معنی هستند؛ گزارش‌هایی که اطلاعات کافی نمی‌دهند؛ گزارش‌هایی که اطلاعات غلط می‌دهند؛ گزارش مشکلاتی که ناشی از خطاهای کاربرند؛ گزارش مشکلاتی که ناشی از اشکالات برنامه‌ی شخص دیگری است؛ گزارش مشکلاتی که ناشی از اشکالات شبکه است.<\/p><p class=\"md-block-unstyled\">دلیل اینکه پشتیبانی فنی بدترین بخش برای کار کردن است همین گزارش‌ باگ‌هاست. البته، همه‌ی گزارش باگ‌ها ناخوشایند نیستند: من در اوقات فراغت، نرم‌افزارهای free می‌نویسم و گاهی اوقات گزارش باگ‌هایی شفاف، مفید و حاوی اطلاعات کافی دریافت می‌کنم.<\/p><p class=\"md-block-unstyled\">در این نوشتار سعی می‌کنم به طور شفاف یک گزارش باگ خوب را تشریح کنم. امیدوارم هر کسی قبل از نوشتن گزارش باگ این نوشته را بخواند.<\/p><p class=\"md-block-unstyled\">به طور اساسی، هدف گزارش باگ این است که برنامه‌نویس عملکرد نادرست برنامه را جلوی خود ببیند. می‌توانید شخصاً باگ‌ها را به برنامه‌نویسان نشان دهید، یا دستورالعملی بنویسید که با دنبال کردن آن برنامه دچار اشکال شود. اگر برنامه‌ دچار اشکال شود، برنامه‌نویسان اطلاعات بیشتری جمع آوری می‌کنند تا بفهمند که علت بروز اشکال در کجاست. اگر برنامه برای آن‌ها دچار اشکال نشود، از شما خواهند خواست تا اطلاعات بیشتری برای آن‌ها جمع آوری کنید.<\/p><p class=\"md-block-unstyled\">در گزارش باگ‌ها سعی کنید حقایق را شفاف بیان کنید «من داشتم با کامپیوتر کار می‌کردم و این باگ اتفاق افتاد» و فرضیه‌هایتان را جدا از آن‌ها مطرح نمایید «من فکر می‌کنم مشکل از اینجا باشد». می‌توانید فرضیه‌ای ارائه نکنید ولی حقایق را از قلم نیاندازید.<\/p><p class=\"md-block-unstyled\">وقتی باگی را گزارش می‌کنید، می‌خواهید که آن باگ برطرف (fix) شود. دلیلی بر فحش دادن به برنامه‌نویس یا لجبازی کردن نیست: ممکن است اشکال از طرف او باشد و این مشکل شماست، و ممکن است حق داشته باشید که از دست او عصبانی شوید، ولی باگ وقتی برطرف می‌شود که شما اطلاعات کافی و مورد نیاز را در اختیار برنامه‌نویس قرار دهید. به یاد داشته باشید که اگر برنامه‌ای free باشد، نویسنده آن‌ را از روی لطف ارائه کرده است، پس اگر عده‌ی زیادی با او بد صحبت کنند و به او ناسزا بگویند ممکن است دیگر برنامه را ارائه نکند.<\/p><h3 class=\"md-block-header-three\">«این کار نمی‌کند»<\/h3><p class=\"md-block-unstyled\">برای هوش برنامه‌نویستان کمی احترام قائل شوید: اگر برنامه ابداً کار نمی‌کرد، او احتمالا متوجه می‌شد. از آنجا که او متوجه نشده است پس حتماً برنامه برای او کار می‌کند. بنابراین، یا شما کاری متفاوت از آنچه که او انجام می‌دهد انجام می‌دهید، یا محیطی که شما در حال اجرای برنامه در آن هستید با محیط برنامه‌نویس فرق می‌کند. او به اطلاعات نیاز دارد؛ مقصود از گزارش باگ ارائه این اطلاعات است. ارائه اطلاعات بیشتر همیشه بهتر است.<\/p><p class=\"md-block-unstyled\">بسیاری از برنامه‌ها، بخصوص برنامه‌های free لیست باگ‌های گزارش شده را منتشر می‌کنند. اگر لیستی از باگ‌های گزارش شده در دسترس شماست، ارزشمند است که پیش از گزارش باگ، آن‌ها را بخوانید تا متوجه شوید که قبلاً کسی آن‌ را گزارش کرده یا خیر. اگر قبلاً باگ گزارش شده است، گزارش دوبار‌ه‌ی آن کار بیهوده‌ای است. ولی اگر فکر می‌کنید که اطلاعات بیشتری نسبت به آنچه گزارش شده دارید، می‌توانید برنامه‌نویس را از این موضوع مطلع کنید. برنامه‌نویس با داشتن اطلاعات بیشتر راحت‌تر می‌تواند باگ را برطرف کند.<\/p><p class=\"md-block-unstyled\">این نوشتار پر از راهنمایی است. هیچ یک از این راهنمایی‌ها یک قانون مطلق نیستند. برنامه‌نویسان خاص، راه‌های خاصی برای دریافت گزارش باگ دارند. اگر برنامه با «اصول گزارش باگ» ارائه شده، آن را بخوانید. اگر مفاد آن سند با راهنمایی‌های ارائه شده در این نوشتار همخوانی ندارد، آن مفاد را دنبال کنید!<\/p><p class=\"md-block-unstyled\">اگر باگی گزارش نمی‌کنید و تنها در استفاده از برنامه به کمک احتیاج دارید، باید اعلام کنید که قبلاً در کجا به دنبال پاسخ سؤالتان گشته‌اید. («من بخش ۵.۲ و فصل ۴ مستندات نرم‌افزار را خوانده‌ام ولی هیچ صحبتی از امکان‌پذیر بودن این قابلیت ذکر نشده») این به برنامه‌نویسان می‌گوید که مردم در کدام قسمت‌های مستندات به دنبال جوابشان می‌گردند، به این ترتیب آن‌ها مستندات را به نحوی اصلاح می‌کنند که استفاده از آن آسانتر باشد.<\/p><h3 class=\"md-block-header-three\">«به من نشان بدهید»<\/h3><p class=\"md-block-unstyled\">یکی از بهترین روش‌های گزارش باگ نشان‌ دادن آن به برنامه‌نویس است. او را به جلوی کامپیوتر بیاورید، نرم‌افزار را اجرا کنید و توضیح دهید چه موقع برنامه‌ درست کار نمی‌کند. اجازه دهید ببیند که کامپیوتر را روشن می‌کنید، ببیند نرم‌افزار را اجرا می‌کنید، ببیند با نرم‌افزار کار می‌کنید و ببیند که نرم‌افزار به ورودی شما چه پاسخی می‌دهد.<\/p><p class=\"md-block-unstyled\">برنامه‌نویس برنامه را مثل کف دستش می‌شناسد. می‌داند به کدام بخش اطمینان دارد و کدام بخش ممکن است مسأله‌ساز شود. برنامه‌نویس می‌داند که به چه چیزی باید نگاه کند. مواقعی که برنامه عملیاتی کاملاً اشتباه انجام می‌دهد، ممکن است از روی رفتار قبلی برنامه متوجه اشکال برنامه شود. برنامه‌نویس می‌تواند در زمان اجرای تست برنامه کاملاً سیستم را تحت نظر بگیرد و نکات مهم را یادداشت کند.<\/p><p class=\"md-block-unstyled\">این ممکن است کافی نباشد. ممکن است به این نتیجه برسد که به اطلاعات بیشتری نیاز دارد و از شما بخواهد که مجدداً اشکال برنامه را به او نشان دهید. ممکن است از شما بخواهد که در حین فرآیند تولید باگ با او صبحت کنید تا بتواند باگ را روی سیستم خودش هم ببیند. ممکن است تلاش کند فرآیند تولید باگ را چند بار تغییر دهد تا متوجه شود که برنامه فقط در آن فرآیند با اشکال روبه‌رو می‌شود یا در یک سلسله فرآیند‌ دچار اشکال می‌شود. اگر بدشانس باشید، ممکن است نیاز باشد چندین ساعت با یک سری ابزارهای برنامه‌نویسی برنامه‌ را تحلیل کنند تا علت مشخص شود. ولی مهم‌ترین بخش این است که برنامه‌نویس وقتی برنامه‌ دچار اشکال می‌شود به کامپیوتر نگاه کند. وقتی متوجه اشکال شود، معمولاً آن گزارش باگ‌ را متوجه می‌شود و سعی می‌کند که آن را برطرف کنند.<\/p><h3 class=\"md-block-header-three\">«به من نشان بده که چطور برای خودم پیش بیاید»<\/h3><p class=\"md-block-unstyled\">در عصر اینترنت هستیم. عصر ارتباطات جهانی. می‌توانم برنامه‌ام را برای شخصی در روسیه بفرستم و او دیدگاهش را در مورد آن ظرف چند دقیقه بگوید. ولی اگر برنامه اشکالی داشته باشد، او نمی‌تواند من را کنار کامپیوترش ببرد و اشکال را به من نشان دهد. «به من نشان بده» خوب است ولی اغلب امکان‌پذیر نیست.<\/p><p class=\"md-block-unstyled\">اگر باید باگی را به برنامه‌نویسی که شخصاً حضور ندارد، گزارش بدهید، هدف شما باید فراهم کردن امکان «تولید مجدد باگ» باشد. از برنامه‌نویس بخواهید نسخه‌ای از برنامه که در اختیار شماست اجرا کند، همان اعمالی که شما انجام می‌دهید تکرار کند و همانطور که شما با اشکال روبه‌رو می‌شوید، با اشکال مواجه شود. وقتی که برنامه‌نویس با چشمان خود می‌بیند که اشکال بروز می‌کند، می‌تواند آن‌ را برطرف کند.<\/p><p class=\"md-block-unstyled\">پس دقیقاً به او بگویید چه کار کردید. اگر یک برنامه‌ی گرافیکی است، بگویید که روی کدام دکمه‌ها و به چه ترتیبی کلیک کردید. اگر یک برنامه‌ی تحت خط فرمان است، به طور دقیق به او بگویید چه چیزی تایپ کرده‌اید. در صورت امکان، باید کلمه به کلمه آنچه که در فرآیند تولید باگ اتفاق می‌افتد بگویید، نشان دهید چه دستوراتی نوشته‌اید و کامپیوتر به آن‌ها چه پاسخی داده است.<\/p><p class=\"md-block-unstyled\">به برنامه‌نویس تمام ورودی‌هایی که تصور می‌کنید ممکن است نقشی داشته باشند ارائه کنید. اگر برنامه اطلاعاتی از یک فایل می‌گیرد، یک کپی از آن فایل ارائه کنید. اگر از پایگاه داده استفاده می‌کند، یک خروجی مناسب از اطلاعات پایگاه داده بگیرید و ارائه کنید. اگر برنامه با کامپیوتر دیگری روی شبکه ارتباط پیدا می‌کند، احتمالاً نمی‌توانید یک کپی از آن کامپیوتر بفرستید، ولی حداقل می‌توانید نوع و مدل آن و نرم افزاری که بر روی آن نصب شده را ذکر کنید.<\/p><h3 class=\"md-block-header-three\">«برای من کار می‌کند. پس مشکل از کجاست؟»<\/h3><p class=\"md-block-unstyled\">اگر به برنامه‌نویس لیستی طولانی از ورودی‌های برنامه و کارهایی که باید انجام شود دادید، نسخه‌ی خودش را اجرا کرد ولی برنامه به درستی کار کرد، به این معناست که شما اطلاعات کافی ارائه نکرده‌اید. احتمالاً اشکال روی هر کامپیوتری ظاهر نمی‌شود؛ کامپیوتر شما با کامپیوتر برنامه‌نویس به نوعی تفاوت دارد. احتمال دارد که شما در مورد عمل‌کرد برنامه دچار سوءتفاهم شده باشید و نتیجه‌ای که شما مشاهده می‌کنید و فکر می‌کنید که اشتباه است همانی است که برنامه‌نویس می‌بیند و فکر می‌کند که صحیح است.<\/p><p class=\"md-block-unstyled\">پس توضیح دهید که چه اتفاقی می‌افتد. به برنامه‌نویس بگویید که چه می‌بینید و فکر می‌کنید که چه چیزی اشتباه است؛ و حتی بهتر است بگویید انتظار دارید چه چیزی ببینید. اگر بگویید «…و بعد درست کار نکرد» اطلاعات مهمی را حذف کرده‌اید.<\/p><p class=\"md-block-unstyled\">اگر پیام خطایی می‌بینید آن را شفاف و دقیق به برنامه‌نویس بگویید. پیام‌های خطا مهم هستند! در این مرحله برنامه‌نویس سعی نمی‌کند مشکل را حل کند، سعی می‌کند که آن را بیابد. او باید بداند که چه اشکالی بوجود آمده و پیام‌های خطا بهترین تلاش کامپیوتر برای بیان این موضوع هستند. اگر راه بهتری برای نگه‌داشتن پیام‌های خطا ندارید، آن‌ها را روی کاغذی یادداشت کنید. گزارش اینکه برنامه پیام خطایی می‌دهد بدون نوشتن آن پیام خطا بی‌ارزش است.<\/p><p class=\"md-block-unstyled\">بخصوص وقتی در پیام خطا عددی وجود دارد، اجازه دهید برنامه‌نویس آن عدد را در اختیار داشته باشد. اینکه شما مفهوم آن اعداد را نمی‌فهمید دلیل بر بی‌اهمیت بودن آن‌ پیام خطا نیست. اعداد زبانی دارند که برنامه‌نویس می‌تواند آن را متوجه شود و احتمالاً سرنخی برای یافتن علت بروز اشکال هستند. وقتی اعداد نمایش داده می‌شوند یعنی کامپیوتر آنقدر گیج شده که نمی‌تواند اشکال را در قالب کلمات بیان کند، با نمایش آن اعداد کامپیوتر اطلاعات با‌ ارزشی ارائه می‌کند.<\/p><p class=\"md-block-unstyled\">در این مرحله، برنامه‌نویس کاملاً نقش یک کارآگاه را بازی می‌کند. برنامه‌نویس نمی‌داند چه چیزی اتفاق افتاده و نمی‌تواند از نزدیک آن را تجربه کند، پس باید به دنبال سرنخی باشد که به منشاء مشکل برسد. پیام‌های خطا، اعداد بی‌معنی و حتی تأخیر غیر موجه برنامه مثل اثر انگشتی در صحنه‌ی جرم با‌ارزش هستند.<\/p><p class=\"md-block-unstyled\">اگر از یونیکس استفاده می‌کنید، ممکن است برنامه core dump تولید کرده باشد. Core dumpها منبع خوبی از اطلاعات هستند پس آن‌ها را دور نیاندازید. از طرف دیگر، اغلب برنامه‌نویسان از گرفتن فایل‌های core بزرگ از طریق ایمیل خوشحال نمی‌شوند. پس پیش از ارسال، حتماً از برنامه‌نویس بپرسید. همچنین آگاه باشید که فایل core حاوی رکوردی از همه‌ی اطلاعات برنامه‌ است: رمز‌های عبور (ممکن است برنامه اطلاعات خصوصی کاربر را نگه‌دارد یا به اطلاعات محرمانه‌ای دسترسی پیدا کند) هم در آن وجود دارد.<\/p><h3 class=\"md-block-header-three\">«بعد از بروز اشکال، سعی کردم…»<\/h3><p class=\"md-block-unstyled\">بعد از ظاهر شدن یک پیام خطا یا یک باگ کارهای زیادی می‌توان انجام داد. ولی بیشتر آن‌ها مشکل را بدتر می‌کنند. یکی از دوستان من همه‌ی فایل‌های word کامپیوترش را تصادفاً پاک کرد، بعد از آن به جای مشورت با یک متخصص، word را دوباره نصب کرد و بعد از آن Defrag را اجرا کرد. هیچکدام از آن‌ها به بازیابی فایل‌های پاک شده‌اش کمک نکردند و در‌ واقع آن اعمال سیستمش را به وضعیتی کشاندند که هیچ برنامه‌ی Undelete ای در دنیا نتواند آن‌ فایل‌ها را برگرداند. اگر او سیستمش را در همان وضعیت رها کرده بود، احتمالاً شانسی برای برگرداندن فایل‌هایش داشت.<\/p><p class=\"md-block-unstyled\">چنین کاربرانی مثل میمون پوزه‌درازی هستند که یک گوشه‌گیر افتاده باشد: وقتی پشت به دیوار باشد و مرگ را در برابرش ببیند دیوانه‌وار حمله می‌کند چون کاری کردن بهتر از هیچ کاری نکردن است! چنین رفتاری با مشکلات کامپیوتری چندان سازگار نیست.<\/p><p class=\"md-block-unstyled\">به جای میمون پوزه‌دراز بودن، بز کوهی باشید! وقتی بز کوهی با چیزی غیر منتظره یا ترسناک مواجه می‌شود، خشکش می‌زند. همانطور ثابت می‌ماند و سعی می‌کند جلب توجه نکند، موقعی که خشکش زده فکر می‌کند که بهترین کار برای خروج از این وضعیت چیست (اگر بزهای کوهی شماره تماس پشتیبانی فنی داشتند، احتمالاً در چنین وضعیتی با آنجا تماس می‌گرفتند) و پس از بررسی احتمالات، ایمن‌ترین راه ممکن را انتخاب می‌کنند.<\/p><p class=\"md-block-unstyled\">وقتی اتفاق بدی می‌افتد، فوراً کار را متوقف کنید. هیچ دکمه‌ای را کلیک نکنید. به صفحه نگاه کنید و هر چیز غیرعادی که اتفاق افتاد یادداشت کنید. سپس با احتیاط دکمه‌ی ok یا cancel را بزنید (هرکدام که ایمن‌تر است) سعی کنید عکس‌العمل مناسبی نشان دهید – خشکتان بزند!<\/p><p class=\"md-block-unstyled\">اگر تصمیم گرفتید از وضعیت بروز مشکل خارج شوید، با بستن برنامه یا با ریست کردن کامپیوتر، ایده‌ی خوبی است که سعی کنید دوباره آن اشکال را بوجود بیاورید. برنامه‌نویسان اشکالاتی که چند بار قابل تولید شدن هستند دوست دارند. فراموش نکنید که یک برنامه‌نویس خوشحال باگ‌ها را سریع‌تر و بهتر برطرف می‌کند.<\/p><p class=\"md-block-unstyled\">«فکر می‌کنم ماجول tachyon اشتباهاً پولاریزه شده»<\/p><p class=\"md-block-unstyled\">فقط غیر-برنامه‌نویسان نیستند که بد گزارش باگ می‌نویسند. بعضی از بدترین گزارش باگ‌هایی که در عمرم دیدم از برنامه‌نویسان بود و حتی از برنامه‌نویسان خوب.<\/p><p class=\"md-block-unstyled\">مدتی با برنامه‌نویس دیگری کار می‌کردم که در کدهای خودش باگ‌هایی پیدا می‌کرد و سعی می‌کرد آن‌ها را برطرف کند. هر از گاهی به باگی برمی‌خورد که نمی‌توانست آن‌ را برطرف کند، پس با من تماس می‌گرفت. من می‌پرسیدم «چه اشکالی بوجود آمده؟» و او چیزی که فکر می‌کرد باید اصلاح شود به من می‌گفت.<\/p><p class=\"md-block-unstyled\">وقتی ایده‌ش درست بود خیلی خوب بود. یعنی او قبلاً نیمی از کار را انجام داده و ما می‌توانستیم با هم کار را تمام کنیم. این خیلی مفید و مؤثر بود.<\/p><p class=\"md-block-unstyled\">ولی اغلب او اشتباه می‌کرد. مدتی کار می‌کردیم تا بفهمیم چرا یک بخش از برنامه داده‌ی غلط تولید می‌کند و بعد از نیم ساعت گشتن، ناگهان می‌فهمیدیم که آن بخش درست کار می‌کند و بخش دیگری مقصر است.<\/p><p class=\"md-block-unstyled\">مطمئنم او این کار را با یک دکتر نمی‌کند. «دکتر من یه نسخه برای تب کریمه کنگو می‌خوام» مردم می‌دانند که نباید چنین چیزی را به یک دکتر بگویند: شما علایم را تشریح می‌کنید، ناراحتی، درد، تورم یا سرگیجه و اجازه می‌دهید دکتر مشکل را پیدا کند و برای رفع آن دارو تجویز کند. در غیر اینصورت دکتر شما را مالیخولیایی تشخیص می‌دهد.<\/p><p class=\"md-block-unstyled\">در مورد برنامه‌نویسان هم همینطور است. ارائه‌ی تشخیصتان ممکن است گاهی مفید باشد، ولی همیشه علایم بروز اشکال را ذکر کنید. تشخیص علت بروز اشکال یک آیتم اضافی است نه یک جایگزین برای علایم بروز اشکال. همچنین، ارسال قسمتی از کد که تغییر داده شده و مشکل را برطرف می‌کند گزینه‌ی خوبی برای اضافه کردن است ولی معادل ذکر شرایط بروز باگ نیست.<\/p><p class=\"md-block-unstyled\">اگر برنامه‌نویس از شما اطلاعات بیشتری خواست، آن را از خودتان نسازید! شخصی باگی را گزارش کرده بود، من از او خواستم تا دستوری را وارد کند که می‌دانستم کار نخواهد کرد. دلیل اینکه از او خواستم تا آن را وارد کند این بود که می‌خواستم بفهمم کدام پیام خطا را تولید می‌کند و از روی آن پیام خطا ریشه مشکل را بیابم. ولی او آن دستور را وارد نکرد – فقط به من ایمیل زد و گفت «نه، این دستور کار نخواهد کرد». مدتی زمان‌ برد تا او را قانع کردم که آن دستور را بزند.<\/p><p class=\"md-block-unstyled\">استفاده از هوشتان برای کمک به برنامه‌نویس خوب است. ولی حتی اگر عملتان اشتباه باشد، آن را انجام دهید. برنامه‌نویس از اینکه سعی کرده‌اید زندگیش را آسانتر کنید، سپاسگزار خواهد بود. ولی علایم را هم گزارش کنید، در غیر اینصورت زندگیش را بسیار سخت‌تر خواهید کرد.<\/p><h3 class=\"md-block-header-three\">«مسخره‌ است، یک دقیقه پیش کار کرد.»<\/h3><p class=\"md-block-unstyled\">به هر برنامه‌نویسی بروز «مشکل تناوبی» را بگویید چهره در هم می‌کشد. آسانترین مسائل آن‌هایی هستند که با یک مرحله اجرای فرآیند مشکلشان بروز می‌کند. برنامه‌نویس می‌تواند این فرآیند را در شرایط آزمایشی بررسی کند و ببیند چه اتفاقی می‌افتد. بسیاری از مسائل به این شکل نیستند: برنامه‌هایی هستند که هفته‌ای یکبار دچار اشکال می‌شوند، یا ماهی یکبار، یا وقتی سعی کنید به برنامه‌نویس نشانشان دهید دچار اشکال نمی‌شوند ولی وقتی موعد تحویل کار نزدیک است همیشه دچار اشکال می‌شوند.<\/p><p class=\"md-block-unstyled\">بیشتر مشکلات تناوبی واقعاً متناوب نیستند. بیشتر آن‌ها منطقی دارند. بعضی از این مشکلات وقتی اتفاق می‌افتند که حافظه کم بیاید، بعضی وقتی پیش میایند که برنامه‌ی دیگری سعی کند فایلی را در زمان نامناسبی تغییر دهد و بعضی دیگر فقط نیم ساعت اول هر ساعت! (من خودم یکی از این باگ‌ها را دیده‌ام)<\/p><p class=\"md-block-unstyled\">همچنین اینکه شما می‌توانید باگی را تولید کنید که برنامه‌نویس نمی‌تواند آن را تولید کند به تفاوت کامپیوترهای شما برمی‌گردد. برنامه‌ای داشتم که پنجره‌اش در قسمت بالا سمت چپ پیچ می‌خورد و دچار اشکال می‌شد ولی این اشکال فقط بر روی صفحه نمایش‌های با رزولوشن ۸۰۰×۶۰۰ اتفاق می‌افتاد و با رزولوشن ۱۰۲۴×۷۶۸ بدون اشکال ظاهر می‌شد.<\/p><p class=\"md-block-unstyled\">برنامه‌نویس می‌خواهد هر اطلاعاتی که شما در مورد مسأله می‌توانید بدست آورید بداند. شاید بخواهد آن را روی ماشین دیگری امتحان کنید. آن را دو یا سه بار امتحان کنید و ببینید چند بار اشکال ظاهر می‌شود. اگر وقتی مشغول کار جدی هستید اشکال بروز می‌کند و وقتی می‌خواهید آن را توضیح دهید ظاهر نمی‌شود، احتمالاً اجرا برای طولانی مدت یا فایل‌های باز زیاد عامل بروز اشکال است.سعی کنید تا جایی که می‌توانید جزییات شرایط بروز اشکال را به خاطر بسپارید. اگر الگویی بین عوامل بروز اشکال می‌بینید آن را ذکر کنید. هر چیزی می‌تواند کمک کند. حتی اگر به نظر بی‌ارتباط باشد (مثلاً «به نظر می‌رسد وقتی Emacs در حال اجرا باشد برنامه‌ بیشتر دچار اشکال می‌شود»)، چنین جزییاتی ممکن است سرنخ مستقیمی به علت بروز مشکل نباشد ولی به برنامه‌نویس کمک می‌کند که اشکال را دوباره تولید کند.<\/p><p class=\"md-block-unstyled\">مهمتر از همه، اغلب اوقات برنامه‌نویس می‌خواهد مطمئن شود که با یک مسأله تناوبی واقعی روبروست یا یک اشکال مربوط به کامپیوتر. برنامه‌نویس اطلاعات زیادی از کامپیوتر شما می‌خواهد تا بداند که چقدر با کامپیوتر او متفاوت است. بسیاری از این جزییات به ماهیت برنامه ربط دارند ولی چیزی که قطعاً برای ارائه‌ی آن باید آماده باشید نسخه‌ی برنامه‌هایی است که استفاده می‌کنید. نسخه‌ی خود برنامه و نسخه‌ی سیستم عامل و احتمالاً نسخه‌ی برنامه‌هایی که با برنامه درگیر هستند.<\/p><h3 class=\"md-block-header-three\">«پس من دیسک را به ویندوز بارگزاری کردم…»<\/h3><p class=\"md-block-unstyled\">شفاف‌ نوشتن در گزارش باگ ضروری است. اگر برنامه‌نویس نفهمد که شما چه می‌گویید، احتمالاً مثل این است که شما اصلا چیزی نگفته‌اید.<\/p><p class=\"md-block-unstyled\">من از همه‌ی نقاط دنیا گزارش باگ دریافت می‌کنم. بسیاری از آن‌ها غیر انگلیسی زبان هستند و بسیاری از آن‌ها به خاطر ضعیف بودن انگلیسی‌شان عذرخواهی می‌کنند. عموما، عذرخواهی در گزارش باگ‌هایی است که مفید و شفاف هستند. اغلب گزارش‌های غیرشفاف از انگلیسی‌ زبانان است که تصور می‌کنند من زبانشان را می‌فهمم، این‌ها حتی تلاشی برای شفاف کردن یا دقیق‌تر بیان کردن منظورشان انجام نمی‌دهند.<\/p><p class=\"md-block-unstyled\">دقیق باشید. اگر فرآیندی به دو طریق قابل انجام است بیان کنید که از کدام روش آن را انجام دادید. «من بارگذاری کردم» می‌تواند «روی دکمه‌ی بارگذاری کلیک کردم» یا «من کلید‌های ALT+L را زدم» تصور شود. پس بگویید کدامیک را انجام داده‌اید. گاه این موضوع اهمیت دارد.<\/p><p class=\"md-block-unstyled\">مفصل بگویید. اطلاعات بیشتری بدهید. اگر زیاد بنویسید برنامه‌نویس می‌تواند بخشی از آن را نادیده بگیرد. اگر کم بگویید، برنامه‌نویس باید بیاید و سؤال‌های بیشتری بپرسد. گزارش باگی دریافت کردم که یک خط بود؛ هر موقع اطلاعات بیشتری می‌خواستم، گزارش دهنده یک جمله‌ی دیگر جواب می‌داد. چند هفته طول کشید تا به اطلاعات کافی رسیدم به این دلیل که هر بار گزارش دهنده فقط یک جمله تایپ می‌کرد.<\/p><p class=\"md-block-unstyled\">مواظب ضمیر‌ها باشید. از کلماتی مثل «آن» یا عبارات معرفه «همان پنجره» وقتی که باعث ابهام می‌شوند، استفاده نکنید. این را ببینید: «من برنامه‌ی FooApp رو اجرا کردم. اون یه پیام هشدار داد. سعی کردم که ببندمش و کرش کرد.» در اینجا شفاف نیست که کاربر سعی کرده کدام پنجره را ببندد. سعی کرده پنجره‌ی هشدار را ببندد یا کل برنامه را؟ به جای آن می‌توانید بگویید «من برنامه‌ی FooApp را اجرا کردم، که یک پیام هشدار داد. سعی کردم پنجره‌ی هشدار را ببندم که برنامه‌ی FooApp کرش کرد» این گزارش باگ طولانی‌تر است ولی شفاف‌تر بوده و درک آن آسانتر است.<\/p><p class=\"md-block-unstyled\">آنچه نوشته‌اید بخوانید. گزارش باگ را برای خودتان بخوانید و ببینید که از نظر خودتان شفاف است. اگر لیست اعمالی که باعث بروز باگ می‌شوند نوشته‌اید، خودتان یکبار آن‌ها را دنبال کنید و ببینید که چیزی را از قلم نیانداخته باشید.<\/p><h3 class=\"md-block-header-three\">خلاصه<\/h3><p class=\"md-block-unstyled\">مقصود از گزارش باگ نشان دادن اشکال برنامه به برنامه‌نویس است. اگر نمی‌توانید اشکال را به برنامه‌نویس نشان دهید، دستورالعملی بنویسید که با پیروی از آن برنامه دچار اشکال می‌شود.<\/p><p class=\"md-block-unstyled\">در صورتی‌‌که گام اول موفقیت آمیز نبود، و برنامه‌نویس نتوانست اشکال را ببیند، هدف دوم تشریح حالت بروز اشکال است. همه‌ چیز را با جزییات توضیح دهید. بگویید چه چیزی می‌بینید و انتظار دارید چه چیزی ببینید. پیام‌های خطا را یادداشت کنید، بخصوص پیام‌هایی که عدد در آن‌ها وجود دارد.<\/p><p class=\"md-block-unstyled\">وقتی کامپیوتر رفتاری غیر منتظره نشان می‌دهد، تکان نخورید. به هیچ چیز دست نزنید تا وقتی که آرام شوید. کاری که حدس می‌زنید خطرناک است انجام ندهید.<\/p><p class=\"md-block-unstyled\">اگر می‌توانید، با هر ابزاری سعی کنید ریشه مشکل را پیدا کنید، ولی اگر ریشه مشکل را یافتید، همچنان باید علایم بروز اشکال را در گزارشتان بنویسید.<\/p><p class=\"md-block-unstyled\">در صورت درخواست برنامه‌نویس، برای ارائه‌ی اطلاعات بیشتر حاضر باشید. اگر به اطلاعاتی نیاز نداشته باشد آن را از شما نمی‌خواهد. برنامه‌‌نویس سر به هوا نیست. نسخه‌ی برنامه‌ها را در دسترس داشته باشید چون به احتمال زیاد نیاز خواهند شد.<\/p><p class=\"md-block-unstyled\">شفاف بنویسید. بگویید که منظورتان چیست و مطمئن شوید که از آن برداشت دیگری نمی‌شود.<\/p><p class=\"md-block-unstyled\">از همه مهمتر، دقیق باشید. برنامه‌نویسان دقت را دوست دارند.<\/p><p class=\"md-block-unstyled\">……………………………………………………………………………………………………<\/p><p class=\"md-block-unstyled\">پانویس:<\/p><p class=\"md-block-unstyled\">- گزارش باگ، پیامی است که حاوی درست کار نکردن برنامه در یک یا چند قسمت است.<\/p><p class=\"md-block-unstyled\">- ترک دعوا: من خودم هیچ وقت میمون‌ پوزه‌دراز یا بز کوهی ندیدم. شاید جانورشناسی من درست نباشد.<\/p>","force_drafted":false,"updated_at":"۲ ماه پیش"},{"id":402417,"post_id":55937,"hash":"orerf7bvrvcj","title":"اصطلاح شناسی جاوا اسکریپت: lexical \/ dynamic scope","body":"<figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/orerf7bvrvcj\/nnbxf4zgytxz.jpeg\" alt=\"Photo by Markus Spiske temporausch.com from Pexels\" \/><figcaption className=\"md-block-image-caption\">Photo by Markus Spiske temporausch.com from Pexels<\/figcaption><\/figure><p class=\"md-block-unstyled\">همانطور که در عنوان قابل مشاهده است عبارت lexical scope از دو کلمه تشکیل شده. پس کار را با معرفی scope شروع کرده و سپس به توصیف وضعیتی که مشهور به lexical است بپردازم.<\/p><h3 class=\"md-block-header-three\">معرفی scope<\/h3><p class=\"md-block-unstyled\">قطعه کد زیر را در نظر بگیرید.<\/p><pre class=\"md-block-code\"><span class=\"code-container\">var mahsool = 'pashmak';\nfunction chap () {\n   console.log(mahsool);\n}\nchap();<\/span><\/pre><p class=\"md-block-unstyled\">دلیل اینکه این کد عبارت «pashmak» را در کنسول چاپ می‌کند این است که جاوا اسکریپت وقتی به قصد اجرا وارد بدنه فانکشن chap می‌شود می‌بیند که چیزی به اسم mahsool می‌بایست به تابع console.log بدهد. پس جستجویی را برای یافتن آن آغاز می‌کند. این جستجو در چند محدوده اجرا می‌شود و به این محدوده‌ها اصطلاحا scope گفته می‌شود. اولین scope طبیعتا در بدنه همین تابعی است در حال اجرای آن است (در اینجا فانکشن chap). مشخصا این جستجو موفقیت آمیز نخواهد بود. پس از این شکست، جاوا اسکریپت به دنبال پیدا کردن مقدار متغییر در محلی که تابع در آن صدا زده می‌گردد و این بار موفق می‌شود متغییر mahsool = &#x27;pashmak&#x27;‎ را بیابد و نهایتا آن را در کنسول چاپ کند. <\/p><blockquote class=\"md-block-blockquote\">به محدوده‌هایی که سیستم در آن‌ها به دنبال مقدار یک متغییر می‌گردد اصطلاحا Scope گفته می‌شود. <\/blockquote><h3 class=\"md-block-header-three\">سیاست Lexical Scope<\/h3><p class=\"md-block-unstyled\">حال قطعه کد زیر را در نظر بگیرید.<\/p><pre class=\"md-block-code\"><span class=\"code-container\">function tashih_ba_daste_baste() {\n console.log( nomre ); \/\/ 9.75\n }\n \n function tashih() {\n   var nomre = 10;\n   tashih_ba_daste_baste();\n }\n \n var nomre = 9.75;\n tashih();<\/span><\/pre><p class=\"md-block-unstyled\">خب خروجی کد بالا ۹.۷۵ است! متاسفم. دلیل این مساله در استراتژی جاوا اسکریپت در انتخاب scope هاست. وقتی جاوا اسکریپت متد tashih را اجرا می‌کند، به فانکشن tashih_ba_daste_baste می‌رسد. مشخصا در اسکوپ این فانکشن هیچ خبری از متغییر nomre نیست. پس به سراغ جایی که اولین بار متد tashih در آن <strong class=\"md-inline-bold\">نوشته شده<\/strong> می‌رود و گم شده خویش را در آنجا می‌یابد (خط ۱۰ و ۱۱ - با تشکر از آقا محسن عزیز). به این سیاست اصطلاحا Lexical Scope گفته می‌شود.<\/p><blockquote class=\"md-block-blockquote\">در <strong class=\"md-inline-bold\">Lexical Scope<\/strong> در صورت پیدا نشدن متغییر در اسکوپ فعلی، اسکوپ بعدی جایی است که تابع در آنجا <strong class=\"md-inline-bold\">نوشته<\/strong> شده است.<\/blockquote><p class=\"md-block-unstyled\"><br\/><\/p><h3 class=\"md-block-header-three\">سیاست Dynamic Scope<\/h3><p class=\"md-block-unstyled\">قطعه کد زیر را در نظر بگیرید<\/p><pre class=\"md-block-code\"><span class=\"code-container\">function tashih_ba_daste_baaz() {\n\tconsole.log( this.nomre ); \/\/ 10  (na 9.75!)\n}\n\nfunction tashih() {\n\tthis.nomre = 10;\n\ttashih_ba_daste_baaz();\n}\n\nthis.nomre = 9.75;\n\ntashih();<\/span><\/pre><p class=\"md-block-unstyled\">تبریک می‌گم! خروجی کد بالا ۱۰ است. اما چطور؟<\/p><p class=\"md-block-unstyled\">جاوا اسکریپت در خصوص متغییر کلیدی <strong class=\"md-inline-bold\">this<\/strong> رفتار ویژه‌ای اتخاذ می‌کند. چون this ژن‌ خوبی دارد، وقتی در اسکوپ فعلی آن را پیدا نکند، به سراغ جایی که متد حاوی this را صدا زده می‌رود و از ایشان می‌پرسد: معذرت می‌خوام ایشون آقا زاده شما هستن؟ اگر جواب منفی بگیرد باز هم از پا نمی‌نشیند و سراغ فانکشن‌هایی که آن فانکشن‌ها را صدا زده اند می‌رود و القصه اینکار تا خود اسکوپ global ادامه پیدا می‌کند.<\/p><blockquote class=\"md-block-blockquote\"><strong class=\"md-inline-bold\">اسکوپ گلوبال<\/strong> (global scope) بالاترین سطحی است که جاوا اسکریپت برای پیدا کردن متغییرها به آنجا سر می‌زند. هر متغییری خارج از بدنه یک function تعریف شده باشد در سطح global قرار می‌گیرد. به عنوان مثال در محیط مرورگرها، آبجکت window یک متغییر در سطح گلوبال است.<\/blockquote><p class=\"md-block-unstyled\">پس در اینجا وقتی tashihe_ba_daste_baz هیچ تعریفی در خصوص this.nomre ندارد، کار جستجو در متد tashih دنبال می‌شود. در آنجا this.nomre = 10 دیده می‌شود و جستجو خاتمه می‌یابد و بقیه کار دنبال می‌شود. به این ترتیب است که سیاست Dynamic Scope در این کد اجرا می‌شود.<\/p><blockquote class=\"md-block-blockquote\">در <strong class=\"md-inline-bold\">Dynamic Scope<\/strong> در صورت پیدا نشدن یک متغییر، جستجو برای پیدا کردن آن در <strong class=\"md-inline-bold\">سلسله توابعی منجر به اجرا شدن این فانکنشن شده‌اند<\/strong>، دنبال می‌شود.<\/blockquote><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">در آینده نزدیک مطلبی در خصوص روش‌های تشخیص مقدار this از روی کد خواهم نوشت.<\/p><p class=\"md-block-unstyled\"><br\/><\/p><h3 class=\"md-block-header-three\"><\/h3><h3 class=\"md-block-header-three\"><\/h3><p class=\"md-block-unstyled\"><br\/><\/p>","force_drafted":false,"updated_at":"۲ ماه پیش"},{"id":172380,"post_id":58588,"hash":"x471sncnqmml","title":"رفتارشناسی سامورایی و نینجا","body":"<figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/x471sncnqmml\/xkkcf1nyqjvl.jpeg\" alt=\"عکس‌ دستکاری شده از ویکی پدیا و purepng.com\" \/><figcaption className=\"md-block-image-caption\">عکس‌ دستکاری شده از ویکی پدیا و purepng.com<\/figcaption><\/figure><h3 class=\"md-block-header-three\">هاه؟<\/h3><p class=\"md-block-unstyled\">بعد از برف‌ و کولاک تابستانه مکزیک، حضور گسترده موج گرما در کشور و ورشکسته شدن عجیب شرکت مایکروسافت! و به دنبال دیدار نخست وزیر ژاپن با مقامات کشورمان شاهد حضور تعداد زیادی از مبارزان ژاپنی در سطح شهرها هستیم. لذا نیاز است هموطنان عزیزمان با این اتباع ژاپنی بیشتر آشنا شوند تا علاوه بر هم‌افزایی و همدلی با این عزیزان امکان استفاده از توانمندی‌های آن‌ها فراهم شود.<\/p><p class=\"md-block-unstyled\">خب همین الان اطلاع دادند که شرکت مایکروسافت موفق شد از ورشکستگی نجات پیدا کند. جای نگرانی نیست. بقیه مطلب کاملا صحیح است و به هیچ وجه مو لای درزش نمی رود. با خیال راحت به مطالعه‌ی خویش ادامه دهید...<\/p><h3 class=\"md-block-header-three\">سامورایی و اما سامورایی<\/h3><p class=\"md-block-unstyled\">اگر موقع رفتن به سر کار یا برگشتن از محل کار تصادفا فردی ژاپنی دیدید که با لباس فاخر ژاپنی، کلاه‌خود فلزی بر سر و شمشیری بر کمر به سمت سربالایی خیابان آهسته و مصمم قدم برمی‌داشت. این احتمال وجود دارد که او یک سامورایی باشد و احتمال بیشتری وجود دارد که اسم لباسش کومینو باشد. پس برای اینکه با او سر صحبت را باز کنید بجای «این لباس چیه پوشیدی؟» می‌توانید خردمندانه و محترمانه بپرسید «کومینو چند؟»<\/p><p class=\"md-block-unstyled\">سامورایی‌ها از طبقه ممتاز جامعه هستند، پس اگر جواب شما را ندادند اصلا روحیه خود را نبازید! اینقدر اصرار کنید تا به حرف بیایند. اگر احساس کردید آثار خشم در چهره‌‌شان هویدا شده، و شمشیر از غلاف بیرون کشیدند، فورا به آن‌ها پشت کنید. سامورایی‌ها رفتاری جوانمردانه دارند و همیشه رو در رو مبارزه می‌کنند. پس خیالتان از بابت شمشیرشان راحت باشد ولی در مورد نیزه‌ و تیر و کمانشان هیچ تعهدی وجود ندارد. در گذشته تلاش‌های زیادی صورت گرفت تا در خصوص آن‌ها هم شرایط مبارزه رودررو در نظر گرفته شود ولی دشمنان در مبارزه اغلب سر و کله‌ی خود را زیاد به اطراف می‌چرخاندند و پیدا کردن سمتی که از آنجا بشود تیر و نیزه را مستقیما به دشمن شلیک کرد خیلی دشوار بود. پس مجلس نمایندگان سامورایی‌ها این قانون را موقتا لغو کرد و از آن به بعد، این بند از مبارزات سامورایی‌ها هر سال تمدید می‌شود.<\/p><p class=\"md-block-unstyled\">نکته‌ی دیگر اینکه سامورایی‌ها معمولا برای امپراطور کار می‌کنند. پس اگر کاری داشتید که نیاز به تخصص یک سامورایی داشت، به راحتی می‌توانید خود را امپراطور معرفی کرده و کار خود را با خیال راحت به سامورایی مورد نظرتان بسپارید. در ضمن نگران پرداخت هم نباشید، معمولا سامورایی‌ها دستمزد خود را پس از انجام کار درخواست می‌کنند. با کمی چرب زبانی شاید بتوانید از پیش‌پرداخت هم طفره بروید یا موضوع پرداخت را با گفتن اینکه «بعدا هم کار زیاد دارم»، «من کلی آشنای سامورایی-لازم دارم» و «این رزومه خوبی برات میشه» عوض کنید. <\/p><h3 class=\"md-block-header-three\">نینجا و کجاست نینجا؟<\/h3><p class=\"md-block-unstyled\">حالا که متوجه شدید سامورایی چه شکلی است، شناختن نینجا اصلا سخت نیست. کافی است بدانید که نینجا هم مثل سامورایی یک مبارز است ولی گستره کارکرد بیشتری دارد. نینجاها از طبقه مرفه نیستند و لباس‌های تنگ و سیاهشان تمام صورتشان را می‌پوشاند. در گذشته دوربین‌های مدار بسته چندان پیشرفتی نداشتند و به همین دلیل مجبور بودند قسمت چشم‌ها را نپوشانند که همین مساله باعث بروز شکست‌های زیادی در ماموریت‌های نینجاها می‌شد. مطمئنا کنجکاو شدید که ماموریت‌های نینجاها چه چیزهایی است؟<\/p><p class=\"md-block-unstyled\">ماموریت‌های یک نینجا می‌تواند شامل اقدامات جاسوسی، مسموم‌سازی و ترور باشد. فراموش نکنید هیچ کس مثل یک نینجا نمی‌تواند جاسوسی کند البته بجز بچه‌های کوچکی که این روزها در هر خانه‌ای حداقل یک جفت از آن‌ها پیدا می‌شود. اطلاعاتی که یک نینجا ممکن است به شما بدهد به اندازه یک دهم اطلاعاتی که از این فسقلی‌ها می‌توانید به دست بیاورید، نیست. با این حال، تجربیات جنگ جهانی دوم و جنگ اعراب با اسراییل نشان داده نمی‌توان از فسقلی‌ها در هر ماموریتی استفاده کرد. پس اگر هدفتان یک جنگ تمام عیار نیست، می‌توانید از امکانات موجود استفاده کنید و در شرایطی غیر از آن مثل جنگ عروس و مادرشوهر حتمن از یک نینجا کمک بگیرید. فراموش نکنید نینجاها ثروتمند نیستند و مثل هر مزدور بی سر و پای دیگری دستمزد خود را پیش از انجام ماموریت می‌گیرند. پس اصلا سعی نکنید در خصوص رزومه و آشناها سر شوخی را با آن‌ها باز کنید. اساسا نینجاها هیچ تعهدی در خصوص مبارزه ندارند و پشت کردن به آن‌ها اصلا دفاع خوبی محسوب نمی‌شود. حتمن ستاره‌هایی که نینجاها پرتاب می‌کنند در کارتون‌ها یا فیلم‌ها دیده‌اید، بدانید که آن‌ها واقعی هستند. در صورت مشاهده ستاره‌های یک نینجا، به سرعت از مسیر عبور آن‌ها خارج شوید. هشدار این مساله‌ به شما داده شد! مسئولیت عواقب برخورد با ستاره‌ها به عهده‌ی خودتان است.<\/p><h3 class=\"md-block-header-three\">چه کسانی باید از نینجاها و سامورایی‌ها بترسند؟<\/h3><p class=\"md-block-unstyled\">بجز روبوکاپ و سوپرمن، سایر افراد جامعه می‌بایست از اینکه هدف ماموریت این بزرگواران قرار بگیرند خوف و هراس داشته باشند. ولی روستانشینان ژاپنی افرادی هستند که صرفنظر از اینکه هدف ماموریت آن‌ها باشند یا نه، از آن‌ها می‌ترسیدند چون آن‌ها بی‌ادبانه روستاهای آن‌ها را غارت می‌کردند و هیچ وقت از کارهای بد خود اظهار پشیمانی نمی‌نمودند.<\/p>","force_drafted":false,"updated_at":"۳ ماه پیش"},{"id":279451,"post_id":null,"hash":"bsgm0pzxofxk","title":"خانم‌ها و آقایون، معرفی می‌کنم... کونگ!","body":"<p class=\"md-block-unstyled\">همه چیز -احتمالا؟- از یکی از شب‌های سرد زمستانی شروع شد. وقتی دو برنامه‌نویس خسته پشت میزشون نشسته بودند و داشتند از دردسرهای پیاده سازی یک چیز روتین مثل فرآیند ورود کاربر به سیستم یا روش گزارش کردن کارهایی که این کاربر با سیستم انجام می ده، غر می‌زدند. اون شب وقتی دو برنامه‌نویس به بورد ترلو نگاه کردند دیدند که چقدر تسک‌های شبیه به هم دارند! <\/p><p class=\"md-block-unstyled\">این موضوع باعث شد فکر کنند چقدر عالی می‌شد اگر این کارهای روتین و مسخره را خود سیستم یا به طور مشخص وب سرور انجام می‌داد؟<\/p><p class=\"md-block-unstyled\">یکی از این دو برنامه‌نویس آن شب نخوابید و تا صبح توی یوتیوب ویدیوهای بامزه تماشا کرد. صبح وقتی خسته و قهوه به دست وارد اتاق کارش شد. دید دوستش خوشحال می‌گه: باید بنویسیمش! پول هنگفتی به جیب می‌زنیم... چند ماه بعد پروژه‌ای به اسم کونگ روی گیت هاب آپلود شد. <\/p><p class=\"md-block-unstyled\">کونگ اساسا یک اپلیکیشن روی پلتفرم OpenResty است. این پلتفرم به این منظور ساخته شده که بتوان برنامه‌هایی ساخت که با وب سرور nginx به راحتی تعامل کنند. <\/p><p class=\"md-block-unstyled\">پس کونگ فقط یک اپلیکیشن ساده است که امکانات جالبی در خصوص ریکوئست ها و ریسپانس‌هایی که به سرور ما وارد یا از اون خارج میشه می تونه اضافه کنه. <\/p><p class=\"md-block-unstyled\">فرض کنیم روی سرور سه سرویس فعال داریم. سرویس اول مربوط به وبلاگ میشه. سرویس دوم مربوط به نمایش اطلاعات آماری وبلاگ و سرویس سوم هم یه سرویس برای <\/p><p class=\"md-block-unstyled\"><br\/><\/p>","force_drafted":false,"updated_at":"۶ ماه پیش"},{"id":226666,"post_id":null,"hash":"i8fvt2sygd9q","title":"یک دیالوگ واقعی","body":"<p class=\"md-block-unstyled\">فریاد می‌زنه:<\/p><p class=\"md-block-unstyled\">«دنیا! چرا همینجوری می‌ری تو کوچه؟»<\/p><p class=\"md-block-unstyled\">«نگفتم نرو تو کوچه؟»<\/p><p class=\"md-block-unstyled\">«نگفتم نرو تو کوچه؟»<\/p><p class=\"md-block-unstyled\">«دنیا! مگه نگفتم همینجوری نرو تو کوچه؟»<\/p><p class=\"md-block-unstyled\">میاد نزدیکتر و صداش ملایم‌تر می‌شه...<\/p><p class=\"md-block-unstyled\">«همینجوری می‌ری تو کوچه ماشینی موتوری میاد می‌زنه می‌کشه تو رو!»<\/p><p class=\"md-block-unstyled\">«نگفتم همینجوری نرو تو کوچه؟»<\/p><p class=\"md-block-unstyled\">«می‌ری تو کوچه اول اینور رو نگاه کن، بعد اونور رو نگاه کن، اگه ماشینی چیزی نمیومد بعد برو تو کوچه!»<\/p><p class=\"md-block-unstyled\">دنیا کوچولو جواب می‌ده: باشه!<\/p><p class=\"md-block-unstyled\">بعد از چند دقیقه... <\/p><p class=\"md-block-unstyled\">- «باشه نه! بگو چشم!»<\/p><p class=\"md-block-unstyled\">- چشم!<\/p>","force_drafted":false,"updated_at":"۸ ماه پیش"},{"id":222357,"post_id":null,"hash":"blw2omph7gjd","title":"شکوایه‌ای بر چکه‌های آب","body":"<p class=\"md-block-unstyled\">من با آب مشکل دارم. نه اینکه مثل اون بنده‌ خدای عربستانی آب نخورم. آب می‌خورم ولی حوصله سر هم کردن بساطش رو ندارم! نوید پسر خاله‌م خیلی تشنه می‌شه یه شب که دیگه داشتیم برای خوابیدن آماده می‌شدیم در اومد که «کاش یه استخر آب خنک بود، من می‌رفتم توش می‌خوابیدم! هر وقت تشنه‌م می‌شد دهنم رو باز می‌کردم و آب می‌خوردم!» لازمه توجه داشته باشید که من از پهنای باند نوید صحبت نمی‌کنم! در مورد سیستم آب رسانی حرف می‌زنم. اتصال لوله‌ها، شیرها و همه این تاسیساتی که بناست ما رو به آب برسونن ولی به حدی دشوار ساخته شدن که آدم دلش برای چشمه و چاه تنگ می‌شه. <\/p><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\"><br\/><\/p>","force_drafted":false,"updated_at":"۹ ماه پیش"},{"id":222353,"post_id":null,"hash":"kjdirifwslas","title":null,"body":null,"force_drafted":false,"updated_at":"۹ ماه پیش"},{"id":205702,"post_id":null,"hash":"awxbk3qg6d5n","title":"آیا ما در جنگ اقتصادی هستیم؟","body":"<p class=\"md-block-unstyled\">اولین اتوبوس‌ها از ساعت ۶:۳۰ به ایستگاه‌ها وارد می‌شوند و مثل سابق تا ساعت ۹ با ترافیک ایستگاه‌ها مواجه هستیم. مترو مثل گذشته از ساعت ۵:۴۵ تا ۱۰:۳۰ شب کار می‌کند. تمامی سازمان‌ها و ادارات طبق برنامه‌ی زمانی گذشته به کار می‌پردازند. در ساعت کاری شرکت‌های خصوصی هم کوچکترین تغییری دیده نمی‌شود. حتی مغازه‌ها هم مثل گذشته و حتی کمی دیرتر شروع به کار می‌کنند. مشخصا این وضعیت هیچ تفاوتی با سال‌های گذشته از خود نشان نمی‌دهد.<\/p><p class=\"md-block-unstyled\">اخبار رسانه‌های جمعی بر محور تقبیح وضعیت اقتصادی کشورهای غربی و شکست‌های دشمنان منطقه‌ای مدیریت می‌شود و در این میان تشویق به خرید از کالاهای ایرانی و معرفی تولیدکنندگان برتر به متن اخبار کشیده شده است. در واقعیت اما قیمت کالاها و خدمات همپای دلار بالا رفته‌اند و هیچ تغییر محسوسی در کیفیت محصولات مشاهده نمی‌شود.<\/p><figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/awxbk3qg6d5n\/aztkgjgompvi.jpeg\" alt=\"این نتیجه فداکاری یک نسل است. ما برای فداکاری حاضریم؟\" \/><figcaption className=\"md-block-image-caption\">این نتیجه فداکاری یک نسل است. ما برای فداکاری حاضریم؟<\/figcaption><\/figure><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">حتمن می‌دانید بعد از جنگ جهانی دوم چیزی از اقتصاد ژاپن باقی نمانده بود ولی امروز ژاپن همتراز بزرگترین قدرت‌های اقتصادی دنیاست. به نظر شما جنگ اقتصادی ما پازل گمشده‌ای ندارد؟ یا شاید بهتر باشد بپرسم به نظر شما اصلا آیا ما در جنگ اقتصادی هستیم؟<\/p>","force_drafted":false,"updated_at":"۹ ماه پیش"},{"id":205471,"post_id":null,"hash":"sfbtbztfm4ss","title":"پازل ۳۰۳","body":"<p class=\"md-block-unstyled\">دوباره یک فرم دیگر روبروی من گذاشتند. این مثل قبلی‌ها نیست. متفاوت است. جنس کاغذش داد می‌زند جدی است...<\/p><p class=\"md-block-unstyled\">می‌خوانم، نوشته «نام: » با همین دو نقطه بعدش. انگار خودش می‌خواهد چیزی بگوید.. نام! <\/p><p class=\"md-block-unstyled\">چیزی که من حتی انتخابش نکردم! بود.. قبل از اینکه من باشم.. پدر و مادر بحث‌ها کردند و نتیجه شد یک نام. یک ۳ حرفی. یک علی. <\/p><p class=\"md-block-unstyled\">می‌نویسمش ولی سرم گیج می‌رود. سعی می‌کنم حواسم را سر جایش نگه‌دارم. چشمانم را باز محکم بهم له می‌کنم. می‌شنوم «له شده.. راننده هم حتمن مرده» کاش حقیقت داشت. هم‌همه بیشتر می‌شود و عده‌ای دور ماشین اینور و آنور فریاد می‌زنند. طعم خون توی دهنم آشناست. درد هم دارد کم کم زبانه می‌کشد. به هر سختی سرم را به راست می‌چرخانم تاریک است ولی همه چیز له شده. جای سارا چرخی تا نیمه ماشین را نورد کرده.. یک مهمان ناخوانده. سارا از مهمانی ناخوانده خوشش نمی‌آید. فریاد می‌زنم ولی در اوج فریادم تنها ناله‌ای بی رمق شنیده می‌شود. همه چیز سفید است تا اینکه دیگر نیست. نوشته‌ها دوباره ظاهر می‌شوند...<\/p><p class=\"md-block-unstyled\">«سن: » می‌نویسم ۳۲. سه و دو. صدای مهمانی اوج می‌گیرد.. سه دو یک! فووووت کن... تولدت مباااارک! چهره‌ی معصوم فاطمه که دو تا شمع تولدش رو فوت می‌کنه و لبخند معصومش.. واااای خدایا... چقدر این فرشته‌ی مهربون رو دوست دارم... <\/p><p class=\"md-block-unstyled\">نباید یادم بیارم.. دیگه گذشته. همه چی تمام شده... باید فکرم رو منحرف کنم. باید به موفقیت فکر کنم. موفقیت بیشتر، کار بیشتر. احساسات برای من خوب نیست. زندگی یعنی موفقیت و کار. بقیه‌ی مسائل حاشیه است. همه چی گذراست. می‌گذره مثل یک تیکه ابر که توی آسمون میاد و یک شکل قشنگ می‌سازه ولی فقط یه ابر بیشتر نیست. یک تصوره. یک وهم و خیاله. موفقیت یعنی همین سوئیچ. زندگی یعنی همین پنت هاوس دوست داشتنی. <\/p>","force_drafted":false,"updated_at":"۹ ماه پیش"},{"id":205270,"post_id":null,"hash":"vtumrmqjz9io","title":"چرا اقیانوس قرمز را به اقیانوس آبی ترجیح می‌دهیم؟","body":"<p class=\"md-block-unstyled\">همه کتاب استراتژی اقیانوس <\/p>","force_drafted":false,"updated_at":"۹ ماه پیش"},{"id":205290,"post_id":null,"hash":"zkb199nsnyjo","title":"سحر خیز باش تا توانی به بازوی خویش!","body":"<figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/zkb199nsnyjo\/rbo2rgfxwbsh.jpeg\" alt=\"عکس از Andre Hunter در سایت Unsplash\" \/><figcaption className=\"md-block-image-caption\">عکس از Andre Hunter در سایت Unsplash<\/figcaption><\/figure><p class=\"md-block-unstyled\">از گذشته این ضرب المثل در بین ما وجود داشته. نه؟! از جد ارجمند من بپرسید. نامبرده همیشه ساعت ۹ شب می‌خوابید و ۶ صبح، کله سحر از خواب بیدار می‌شد. سحرخیزی چندان گزینه‌ و حق انتخابی برای این کشاورز زحمتکش نبود! اگه هم بود گزینه‌ی دشواری نبود!<\/p><p class=\"md-block-unstyled\">در کتاب «کِی؟ ترفندهای علمی زمان‌سنجی عالی» از «دنیل اچ. پینک» که از معدود کتاب‌های تحقیق محور و مستندی است که خوش ساخت است و حوصله آدم را سر نمی‌برد می‌خوانیم که انسان‌ها اساسا از نظر ساعت بیولوژیک به ۳ تیپ کلی تقسیم می‌شوند.<\/p><ul class=\"md-block-unordered-list-item\"><li><strong class=\"md-inline-bold\">تیپ گنجشک‌ها<\/strong> این‌ها همان مرغان سحری هستند که اول صبح ناله سر نداده! و خوشحال از خواب بیدار می‌شوند و در همان ساعات اولیه روز به راحتی می‌توانند روی مطلب مورد نظر و کار خود تمرکز پیدا کنند. این افراد از نظر ترکیب جمعیتی نزدیک ۲۰٪ عوام و خلق خدا را تشکیل می‌دهند.<\/li><li><strong class=\"md-inline-bold\">تیپ جغدها <\/strong>بزرگوارانی هستند که در ساعات اولیه روز اگر هم از خواب بیدار شده باشند، حوصله انجام کارهای جدی و متمرکز را ندارند. وقتی خورشید از نیمه‌ی آسمان گذشت، تمرکز این جماعت کم کم قوت می‌گیرد و تا قبل از نیمه‌های شب نمی‌توانند به خواب بروند! از نظر ترکیب جمعیتی، این عزیزان حدود ۲۰٪ جوامع بشری را تشکیل می‌دهند.<\/li><li><strong class=\"md-inline-bold\">تیپ جغجشک‌ها<\/strong> همانطور که حدس زده‌اید، این تیپ فی‌مابین ۲ تیپ قبلی جای می‌گیرند چرا که نه جغد جغدند و نه گنجشک سحر خیز، این تیپ از نظر جمعیتی ۶۰٪ جامعه را تشکیل می‌دهند و مشخصا ساعت شروع تمرکزشان چیزی بین صبح و بعد از ظهر است.<\/li><\/ul><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">پرسش کلیدی این است که:<\/p><h3 class=\"md-block-header-three\">از کجا بفهمیم که به کدام دسته تعلق داریم؟ <\/h3><p class=\"md-block-unstyled\">ما هر روز از ترس پیدا نشدن جای پارک و دیر رسیدن به سر کار مجبوریم بیدار شده و نشده خود را به محل کار برسانیم!<\/p><p class=\"md-block-unstyled\">- شما برنده‌ی کاپ تلاشگری هستید! ولی بدانید که انسان‌های موفق (از جنس پائلوکوئولینو و نه از جنس بابک زنجانی!) تمام طول روز کار نمی‌کنند - صادقانه نگاه کنیم شما هم تمام طول روز کار نمی‌کنید! - آن‌ها ساعتی که در آن بیشترین بازدهی و اثربخشی را دارند را به کار مشغول هستند و در باقی ساعات به احیا روحیه، انگیزه و تفکرات خویش مشغولند.<\/p><p class=\"md-block-unstyled\">پیشنهاد نویسنده‌ی این کتاب، دوست خوبم دنیل، این است برای اینکه بدانید به کدام دسته تعلق دارید و کشف کنید که در چه وقتی از روز هر ثانیه از وقتتان بیش از یک ساعت! از سایر ساعات روز ارزشمند است، کافی است یک شب بدون تلاش وقتی احساس خواب آلودگی کردید به خواب رفته و فردای آن شب ساعت بیدار شدنتان (بدون استفاده از ساعت (یا موبایل؟) شماته‌ای) را یادداشت نمایید.<\/p><p class=\"md-block-unstyled\">اگر آن ساعت پیش از ساعت ۸ صبح بود، شما به دسته‌ی اول تعلق دارید. اگر حدود ۱۱ صبح بود شما در دسته‌ی دوم طبقه‌بندی می‌شوید و اگر بین ۸ تا ۱۱ بود، شما در جمع اکثریت جامعه هستید.<\/p><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\"><strong class=\"md-inline-bold\">یک توصیه به کارمندان<\/strong><\/p><p class=\"md-block-unstyled\">مهم نیست که در چه دسته‌ای قرار می‌گیرید، در هر صورت قدر ساعت‌های ارزشمند روزتان را بدانید و در تنظیم برنامه‌ی روزانه، ارزشمندترین ساعت را به کارهایی که حقیقتا برای کارتان حیاتی هستند اختصاص دهید. <\/p><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\"><strong class=\"md-inline-bold\">یک توصیه به مدیران<\/strong><\/p><p class=\"md-block-unstyled\">حتمن ساعت‌های ارزشمند افراد تیم کاری خود را شناسایی کنید و تلاش کنید زمانبندی جلسات را به نحوی تنظیم کنید که همه افراد در وضعیت تمرکز نسبی مناسبی باشند. اگر تیمی از جغدها و گنجشک‌ها دارید ابدا سعی نکنید همه را یکسان کنید، از ابزارهای مناسب برای هماهنگی استفاده کنید و اجازه دهید هر دو تیم بیشترین بهره‌وری را داشته باشند.<\/p><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\"><strong class=\"md-inline-bold\">یک نیمچه‌ توصیه به دانش‌آموزان<\/strong><\/p><p class=\"md-block-unstyled\">توصیه خاصی نیست! متاسفانه آموزش و پرورش تلاش بلیغی برای یکسان کردن شما دارد. اگر می‌توانید با همکلاسی‌ها مشارکت کنید و کتاب «کِی؟ ترفندهای علمی زمان‌سنجی عالی» را برای معلمتان بخرید تا او هم از تفاوت‌های ما انسان‌ها مطلع شود و حداقل بخاطر دیر آمدن‌های اول صبح به شما سخت نگیرد.<\/p><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\"><br\/><\/p>","force_drafted":false,"updated_at":"۹ ماه پیش"},{"id":168818,"post_id":null,"hash":"ap3uzfuboyzq","title":"یک پست دیگر از this شناسی جاوا اسکریپت","body":"<figure class=\"md-block-image\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/ap3uzfuboyzq\/zmdr5j1qiicx.jpeg\" alt=\"\" \/><\/figure><p class=\"md-block-unstyled\"><br\/>چون <a class=\"md-inline-link\" href=\"https:\/\/virgool.io\/@ghanavatian.ali\/%D8%A7%D8%B5%D8%B7%D9%84%D8%A7%D8%AD-%D8%B4%D9%86%D8%A7%D8%B3%DB%8C-%D8%AC%D8%A7%D9%88%D8%A7-%D8%A7%D8%B3%DA%A9%D8%B1%DB%8C%D9%BE%D8%AA-lexical-dynamic-scope-orerf7bvrvcj\" target=\"_blank\" rel=\"noopener noreferrer\">قبلا<\/a> قول داده بودم  در خصوص this مطلبی بنویسم، این مطلب را منتشر می‌کنم. دوستان دیگری در <a class=\"md-inline-link\" href=\"https:\/\/virgool.io\/JavaScript8\/use-this-keyword-in-javascript-cpncf5vwru07\" target=\"_blank\" rel=\"noopener noreferrer\">اینجا<\/a> و <a class=\"md-inline-link\" href=\"https:\/\/virgool.io\/@pazirehsarafraz\/37-%D8%AC%D8%A7%D9%88%D8%A7%D8%A7%D8%B3%DA%A9%D8%B1%DB%8C%D9%BE%D8%AA-objects-functions-this-nkj0czswkzzw\" target=\"_blank\" rel=\"noopener noreferrer\">اینجا<\/a> همین مطلب را به قلم خود توضیح داده‌اند.<\/p><p class=\"md-block-unstyled\">من سعی می‌کنم مطلب را به شکل خلاصه و کنکوری بنویسم شاید در مرور مصاحبه به کار بیاید.<\/p><p class=\"md-block-unstyled\">به ۴ شکل کلی می‌توان this را به کار برد و نتایج متفاوتی گرفت. برای تشخیص صحیح، به روش فراخوانی متدی که this در آن قرار دارد توجه کنید:<\/p><p class=\"md-block-unstyled\">۱-  اگر این متد با new صدا زده شده است. مقدار this همان آبجکتی است که در اثر صدا زدن متد با new حاصل می‌شود. ( احتمالن در بدنه متد مقداری به آن داده شده است)<\/p><p class=\"md-block-unstyled\">مثال<\/p><pre class=\"md-block-code\"><span class=\"code-container\">var aberBank = new hesab(1000);\nfunction hesab (mablagh) {\n    this.mojoodi = mablagh;\n}\nconsole.log(aberBank.mojoodi); \/\/ 10000<\/span><\/pre><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">۲- اگر متد با کمک متدهای call یا apply صدا زده شده باشد یا در انتهای فراخوانی آن bind وجود داشته باشد، در این صورت مقدار this همان چیزی است که به عنوان آرگومان به این متدها ارسال شده است.<\/p><pre class=\"md-block-code\"><span class=\"code-container\">var natije = mohasebat.call( inMoteghayerDarMethodeMohasebatHamanThisMishavad );\nیا\nvar natije = mohasebat().bind( inMoteghayerDarMethodeMohasebatHamanThisMishavad );<\/span><\/pre><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">۳- اگر متد به شکل یکی از propertyهای یک آبجکت صدا زده شده باشد، مقدار this همان آبجکتی است که تعریف این متد را در برگرفته است.<\/p><pre class=\"md-block-code\"><span class=\"code-container\">var natije = inObjectDarMethodeMohasebatHamanThisMishavad.mohasebat();<\/span><\/pre><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">۴- اگر وضعیت متد مطابق با هیچ یک از موارد فوق نبود، در صورت فعال بودن <strong class=\"md-inline-bold\">strict mode<\/strong> مقدار this برابر با <strong class=\"md-inline-bold\">undefined<\/strong> و در غیر اینصورت آبجکت global است.<\/p><pre class=\"md-block-code\"><span class=\"code-container\">var natije = mohasebat();<\/span><\/pre><p class=\"md-block-unstyled\"><br\/>تمام.<\/p>","force_drafted":false,"updated_at":"۱۱ ماه پیش"},{"id":162537,"post_id":55419,"hash":"lgpz5u1aae8p","title":"مدیریت حافظه در جاوا اسکریپت","body":"<figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/lgpz5u1aae8p\/qxk1c1ar78ef.jpeg\" alt=\"Image by netkids from Pixabay\" \/><figcaption className=\"md-block-image-caption\">Image by netkids from Pixabay<\/figcaption><\/figure><p class=\"md-block-unstyled\">مدیریت حافظه در زبان‌های سطح پایین (پایین‌تر از جاوا اسکریپت!) مثل C می‌بایست از طرف برنامه‌نویس انجام شود. توابعی برای درخواست حافظه و آزادسازی آن وجود دارد که به فراخور نیاز می‌بایست به کار بسته شوند. ولی در زبان‌های سطح بالا مثل جاوا اسکریپت (یا مثلا جاوا) عملیات مدیریت حافظه در پشت صحنه به کمک فرآیندی مشهور به Garbage Collection انجام می‌شود.<\/p><h3 class=\"md-block-header-three\">فرآیند Garbage Collection<\/h3><p class=\"md-block-unstyled\">طبیعتا هر زمان متغییری تعریف شود، حافظه‌ای برای آن در نظر گرفته می‌شود. <\/p><pre class=\"md-block-code\"><span class=\"code-container\">var yekNumber = 20; \/\/ takhsise hafeze baraye number\nvar yekString = 'salam'; \/\/ takhsise hafeze baraye string \nvar yekObject = { pi: 3.14 }; \/\/ takhsise hafeze baraye object\nvar yekArray = [ 10, 20, 3, 15, 1000, 'o', 60, 16]; \/\/ takhsise hafeze baraye array\nfunction doBarabar(a) {\n   return 2 * a;\n} \/\/ takhsise hafeze baraye function<\/span><\/pre><p class=\"md-block-unstyled\">وقتی دیگر به آن حافظه نیازی نباشد، جاوا اسکریپت آن حافظه را آزاد می‌کند تا بعدا از آن برای مصارف دیگر استفاده شود. پیدا کردن حافظه‌هایی که دیگر مورد نیاز برنامه‌ نیستند بر عهده واحد Garbage Collector است. چیزی شبیه ماشین جمع آوری زباله از سطح شهر!<\/p><p class=\"md-block-unstyled\">برای تشخیص حافظه‌های بلااستفاده چند الگوریتم استفاده می‌شود که دو الگوریتم اصلی آن‌ها معرفی می‌شود:<\/p><ul class=\"md-block-unordered-list-item\"><li><strong class=\"md-inline-bold\">الگوریتم رفرنس-شماری Reference-counting garbage collection<\/strong><\/li><li><strong class=\"md-inline-bold\">الگوریتم نشان-و-گردش Mark-and-sweep algorithm<\/strong><\/li><\/ul><h3 class=\"md-block-header-three\">الگوریتم رفرنس-شماری<\/h3><p class=\"md-block-unstyled\">این مهمترین الگوریتم جمع آوری حافظه است. اگر در الگوریتم رفرنس-شماری، تعداد رفرنس‌های یک متغییر صفر باشد، حافظه آن متغییر (در راه خدا؟) آزاد می‌شود.<\/p><h4 class=\"md-block-header-four\">مثال<\/h4><pre class=\"md-block-code\"><span class=\"code-container\">var khune = { divare_shomal: { panjere: 2 } };\n\/\/ 2 object sakhte shode. \"panjereh\" be onvane propertie \"divare_shomal\" be shey-e \"divare_shomal\" reference mishavad\n\nvar khune = 'dasht'; \/\/ hafeze i k \"divare_shomal\" dar \"khune\" gerefter bud, hala digar reference nadarad va azad-saazi mishavad.<\/span><\/pre><p class=\"md-block-unstyled\"><br\/><\/p><h4 class=\"md-block-header-four\">بحران حلقه<\/h4><pre class=\"md-block-code\"><span class=\"code-container\">function hazfe_fesaad () {\n   var masool = {};\n   var ghanoon = {};\n   \n   ghanoon.sazande = masool;\n  masool.sazande = ghanoon;\n  \n      return 'ok.';\n}<\/span><\/pre><p class=\"md-block-unstyled\">همانطور که در قطعه کد بالا دیده می‌شود متغییر masool در ghanoon رفرنس شده است و متغییر ghanoon در متغییر masool مورد رفرنس قرار گرفته است. دوستان، به چنین وضعیتی حلقه گفته می‌شود. وقتی که اسکوپ از این حلقه عبور کند با وجود اینکه این دو متغییر گرامی بلااستفاده هستند، این الگوریتم قادر به آزاد سازی حافظه‌ای که اشغال کرده‌اند نمی‌باشد و این‌ها همچنان به یکدیگر رفرنس خواهند داشت. این وضعیت باعث بروز نشت حافظه یا اصطلاحا memory leaks می‌شود. پدیده‌ای شیطانی که باعث انحطاط سیستم می‌شود. در اثر هر بار فراخوانی این متد، بیشتر و بیشتر حافظه مصرف می‌کند و وقتی دیگر حافظه‌ای باقی نماند سیستم به سراغ هارد می‌رود و پس از مدتی سیستم چنان درگیر خواهد شد که قادر به انجام هیچ کاری نخواهد بود. ساعت‌ها خواهد گذشت تا یک درخواست ساده ctrl + alt+ delete اجرا شود چون سیستم مشغول انتقال محتویات حافظه به هارد و هارد به حافظه خواهد بود.<\/p><h3 class=\"md-block-header-three\">الگوریتم نشان-و-گردش<\/h3><p class=\"md-block-unstyled\">سیستم جمع آوری حافظه از این الگوریتم برای آزاد سازی حافظه وقتی که یک متغییر دیگر در دسترس نیست استفاده می‌کند.<\/p><p class=\"md-block-unstyled\">سیستم ابتدا تمام ابجکت‌ها و متغییرهای عمومی و گلوبال را پیدا می‌کند. سپس تمام متغییرهایی که توسط آن‌ها و متغییرهای آن متغییرها رفرنس می‌شود، شناسایی می‌کند. به این ترتیب، متغییرهایی که در دسترس هستند و عواملی که در دسترس نیستند شناسایی می‌شود. سپس در یک اقدام سریع تمام عناصری که در دسترس نباشند به صورت خودکار حذف می‌شوند و حافظه‌ای که اشغال کرده‌اند آزاد می‌شود.<\/p><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">این نوشته با الهام از <a class=\"md-inline-link\" href=\"https:\/\/dzone.com\/articles\/memory-management-and-garbage-collection-in-javasc\" target=\"_blank\" rel=\"noopener noreferrer\">این متن<\/a> که خود از <a class=\"md-inline-link\" href=\"http:\/\/www.nodesimplified.com\/2017\/07\/javascript-top-javascript-tips-and.html\" target=\"_blank\" rel=\"noopener noreferrer\">نود سیمپیلی‌فاید<\/a> اقتباس شده نوشته شده است.<\/p>","force_drafted":false,"updated_at":"۱۱ ماه پیش"},{"id":160598,"post_id":null,"hash":"sp907ibxj87b","title":null,"body":"<p class=\"md-block-unstyled\">سحر خیز باش تا... بستگی دارد!<\/p>","force_drafted":false,"updated_at":"۱۱ ماه پیش"},{"id":153290,"post_id":null,"hash":"sy17vosk4qd5","title":"شیر بدشانس یا سوسمار مکار؟","body":"<figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/sy17vosk4qd5\/q5vejvoslwyc.jpeg\" alt=\"منبع: cheezburger.com \" \/><figcaption className=\"md-block-image-caption\">منبع: cheezburger.com <\/figcaption><\/figure><p class=\"md-block-unstyled\">یه دقیقه این ویدیو - که صداش رو حذف کردم - رو ببینین...<\/p><figure class=\"md-block-embed\"><a href=\"https:\/\/www.aparat.com\/v\/StzrT\"> https:\/\/www.aparat.com\/v\/StzrT <\/a><\/figure><p class=\"md-block-unstyled\"><em class=\"md-inline-italic\">منبع: <a class=\"md-inline-link\" href=\"https:\/\/www.instagram.com\/p\/Bwd59iyHl11\/?utm_source=ig_share_sheet&amp;igshid=10w520inm5jcz\" target=\"_blank\" rel=\"noopener noreferrer\">اینستاگرام<\/a><\/em><br\/>حتمن فکر می کنین بیچاره! چه گاو بدشانسی بوده، به این قسمتش کاری ندارم. در مورد شیر چی فکر می کنین؟ اونم بدشانس بوده؟ سوسمار چطور؟ <\/p><p class=\"md-block-unstyled\">این چند خط رو بخونین... اگه نظرتون عوض شد بهم بگین :)<\/p><hr class=\"md-block-hr\"\/><p class=\"md-block-unstyled\">ماجرا از اونجایی شروع شد که با شروع فصل خشکسالی سوسمار که توی فصل ترسالی چیز زیادی واسه خوردن پیدا نکرده بود تصمیم گرفت خوردن نارگیل رو امتحان کنه.<\/p><p class=\"md-block-unstyled\">چرا نارگیل؟<\/p><p class=\"md-block-unstyled\">آخه وقتی میمون‌ها اومده بودن بالای برکه چند تا نارگیل همراهشون بود و با ارامش خاصی مشغول خوردنش شده بودن. این بود که سوسمار گرسنه با خودش گفت چرا که نه؟ شاید مزه آهو بده!<\/p><p class=\"md-block-unstyled\">بگذریم، وقتی سوسمار واسه پیدا کردن نارگیل وسط جنگل اومده بود تازه فهمید که میمون‌ها سر کارش گذاشته بودن و درخت نارگیل اونقدر بلنده که نمیشه به میوه‌هاش رسید.<\/p><p class=\"md-block-unstyled\">ناامید و خسته برگشت به برکه‌ی محقرش برگرده که دید شیره و خانمش دعوا و سر و صداشون بالا گرفته.<\/p><p class=\"md-block-unstyled\">«خسته شدم از بس کباب گاو و کباب اهو خوردم!» آقا شیره می گفت. خانمشم می گفت تو دیگه منو دوست نداری رفتارت از دوران نامزدیمون خیلی عوض شده! ننه م راست می گفت شما مردا همتون تنوع طلبین! اصلا من می رم گله بابام!<\/p><p class=\"md-block-unstyled\">وقتی خانم شیره رفت. سوسمار فکری به سرش زد. آهسته رفت سراغ شیره و یواشکی گفت: «کباب غذای خسته کننده ایه!»<\/p><p class=\"md-block-unstyled\">شیره برگشت و با تعجب گفت: «تو هم از کباب خسته شدی؟»<\/p><p class=\"md-block-unstyled\">سوسماره که صدای شکمش داشت بلند میشد خمیازه ای پر سر و صدا کشید و گفت: «نعععععع. من گاهی ابگوشت می خورم! و به نظرم از کباب خوشمزه تره!»<\/p><p class=\"md-block-unstyled\">شیره گفت منم می خوام!<\/p><p class=\"md-block-unstyled\">... حالا دوباره ویدیو رو ببینین!<\/p><p class=\"md-block-unstyled\"><br\/><\/p>","force_drafted":false,"updated_at":"۱۲ ماه پیش"},{"id":150209,"post_id":null,"hash":"anxptl3yynch","title":null,"body":null,"force_drafted":false,"updated_at":"۱۲ ماه پیش"},{"id":150208,"post_id":null,"hash":"lpcuteue7cyl","title":"نگاهی به فیلم glass","body":"<figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/lpcuteue7cyl\/z1mpjlgnqsbk.jpeg\" alt=\"فیلم glass \" \/><figcaption className=\"md-block-image-caption\">فیلم glass <\/figcaption><\/figure><p class=\"md-block-unstyled\">تا حالا فکر کردین اگه واقعن یه بابایی کارهایی مثل سوپرمن یا اسپایدرمن می کرد چی میشد؟<\/p><p class=\"md-block-unstyled\">الان بهش فکر کنین!<\/p><p class=\"md-block-unstyled\">خیلی خب اگه فکرتون نمیاد جوابش رو می تونین از این فیلم بگیرین. <\/p><p class=\"md-block-unstyled\">وقت فیلم دیدن ندارین؟<\/p><p class=\"md-block-unstyled\">باشه! من بهتون می گم... سر از آسایشگاه روانی درمیاورد!!!<\/p><p class=\"md-block-unstyled\">تو این فیلم می بینین که چطور ۳ فقره سوپر هیرو رو توی یه آسایشگاه روانی نگه داری می کنن! بهشون شوک می‌زنن و به جلسات گروه درمانی می برن!<\/p><p class=\"md-block-unstyled\">جالب اینکه یکیشون (ساموئل جکسون) اساسا یه افلیجه که حتی نمی تونه حرف بزنه!<\/p><p class=\"md-block-unstyled\">کدوم آدم عاقلی همچین فیلمی می سازه؟<\/p><p class=\"md-block-unstyled\">جناب نایت شیامالان! <\/p><p class=\"md-block-unstyled\">کی؟! <\/p><p class=\"md-block-unstyled\">یه هندی پولدار شده تو امریکا.<\/p><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\"><em class=\"md-inline-italic\">پانویس ۱: نسخه هندی گیم اف ترونز رو از دست ندین. :))<\/em><\/p><p class=\"md-block-unstyled\"><br\/><\/p>","force_drafted":false,"updated_at":"۱۲ ماه پیش"},{"id":148600,"post_id":null,"hash":"o951sy6z4cjp","title":"نقطه","body":"<p class=\"md-block-unstyled\">گوی جادویی را روی میز گذاشت. وردی خواند. کمی بعد گوی روشن شد. چشمان جادوگر به سمت بالا رفت و دیگر جز سفیدی چیزی در کاسه چشم‌ها دیده نمی‌شد. صورت رنگ‌پریده‌ی عجوزه مثل گچ سفید شد. جیغی کشید و به روی میز افتاد.<\/p><p class=\"md-block-unstyled\">مرد که عرق سردی بر پیشانی‌اش نشسته بود جام را در کیسه‌ای انداخت و لنگ لنگان از دخمه بیرون رفت.<\/p><p class=\"md-block-unstyled\">صاحب مسافرخانه که پشت میز همیشگی‌اش نشسته بود، پیپ می‌کشید. چند ملوان دور هم جمع شده بودند و پوکر بازی می‌کردند. کمی از نیمه شب گذشته بود که ملوان سراسیمه وارد شد. نگاهی سریع به اطراف انداخت و به سرعت از پله‌های فرسوده‌ی مسافرخانه بالا رفت. در یک چشم بهم زدن وارد اتاق خود شد و در را پشت سر خود قفل کرد. نفس نفس می‌زد. ماه کامل بود و نور نقره‌ای آن از پنجره‌ی بزرگ اتاق به درون می‌تابید. به سمت میزی که در گوشه اتاق بود رفت. گوی را از کیسه خارج کرد و روی میز گذاشت. دستان خود را روی گوی گذاشت و وردی خواند. چهره‌ی مردی در لباس نظامی ظاهر شد که در قصری قدم می‌زد.<\/p><p class=\"md-block-unstyled\">- گابریل! احساس عجیبی دارم. امشب همه جا رو به دقت بررسی کن. حس بدی دارم.<\/p><p class=\"md-block-unstyled\">- اطاعت ژنرال!<\/p><p class=\"md-block-unstyled\">لحن افسر مطیعانه بود. ژنرال سری تکان داد و وارد اتاق خود شد.<\/p><p class=\"md-block-unstyled\">افسر به سمت دفتر خود رفت و دستور داد سربازها طبق شرایط ویژه تمام ورودی‌ها و خروجی‌های قصر را تحت نظر بگیرند و یک نگهبان ویژه پشت در اتاق ژنرال به کشیک گمارد.<\/p><p class=\"md-block-unstyled\">هنوز مدتی از حضور نگهبان نگذشته بود که چشمان نگهبان ناگهان سفید شد. در اتاق ژنرال را باز کرد. آهسته به به تخت او نزدیک شد. ژنرال در خواب فرو رفته بود. میز تحریری کنار تخت بود که قلم و کاغذی روی آن به چشم می‌خورد. دست نگهبان قلم را برداشت و قطره‌ای درشت روی کاغذ چکاند. آنگاه دوباره به سمت تخت رفت و سرنیزه‌اش را در قلب مرد خفته فرو کرد.<\/p><p class=\"md-block-unstyled\">گوی خاموش شد و مرد بی‌رمق کف اتاق افتاد و از هوش رفت.<\/p><p class=\"md-block-unstyled\">فردا ظهر ناقوس کلیسا به صدا در آمد. صدای همهمه‌ای از طبقه‌ی پایین مسافرخانه به گوش می‌رسید که ژنرال کشته‌ شده است.<\/p><p class=\"md-block-unstyled\"><br\/><\/p>","force_drafted":false,"updated_at":"۱۲ ماه پیش"},{"id":148465,"post_id":null,"hash":"ocntoqwsumnq","title":"چرا ایمیل موقت؟ چرا شماره غلط؟","body":"<figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/ocntoqwsumnq\/slfdok2qn59d.jpeg\" alt=\"چرا اینقدر به ایمیل من نیاز داری؟\n\" \/><figcaption className=\"md-block-image-caption\">چرا اینقدر به ایمیل من نیاز داری؟\n<\/figcaption><\/figure><p class=\"md-block-unstyled\">باور کنین یا نه «ایمیل» و «شماره موبایل» جزو دارایی‌های مجازی آدم‌هاست. <\/p><p class=\"md-block-unstyled\">ابوالفضل همیشه می‌گفت: «غذات رو بخور! وقتی سیر شدی، بعد پول رو بده!»<\/p><p class=\"md-block-unstyled\">اگه توی فرم ثبت نام یا لینک دانلود کتابی که تازه ترجمه کردی یا نوشتی ایمیل رو اجباری کردی و شماره موبایل رو هم به زور سرنیزه ولیدیشن می‌خوای بگیری شک نکن یه عده آدم باهوش پیدا می‌شن که از ایمیل موقت و شماره موبایل‌های موقتی یا حتی غلط استفاده کنن واسه اینکه فقط بیان تو، فایل‌ رو بگیرن و بگن «why so serious»<\/p><p class=\"md-block-unstyled\">پس اگه واقعن اون ایمیل و شماره تلفن واقعی رو می‌خوای. صادقانه علتش رو بگو.  شاید کسی حاضر نشه ایمیل واقعیش رو بهت بده - بخاطر اینکه بهترین چیزی که به ذهنت رسیده فروش ایمیل به اسپمرهاست - ولی حداقل احتمالش بیشتره که یه آدرس ایمیل واقعی بگیری که - احتمالا سال‌هاست دیگه چک نمیشه و فقط - کارکردش اینه که قابل فروشه!<\/p><p class=\"md-block-unstyled\">و یک نکته‌ی ظریف اینکه، اگه بعد از دادن کتاب یا اجازه تجربه‌ سیستم به کاربر امکان اعلام ایمیل یا پرداخت وجه رو بدی، مخاطبی که از کارت خوشش اومده باشه از خجالتت درمیاد. به نظرم آدم‌های خوبی هستن که هنوز قدر اعتماد و ارزش کار پرزحمت رو می‌شناسن.<\/p><p class=\"md-block-unstyled\"><br\/><\/p><ul class=\"md-block-unordered-list-item\"><li>به عنوان یک تصمیم گیرنده ترجیح می‌دین از قبل اطلاعات کاربرتون رو بگیرین یا بهش اعتماد می‌کنین؟<\/li><li>به عنوان یک مصرف کننده نظرتون چیه؟<\/li><li>راه سومی می‌تونه وجود داشته باشه؟<\/li><\/ul>","force_drafted":false,"updated_at":"۱۲ ماه پیش"},{"id":144122,"post_id":null,"hash":"ozaqqvtbgobu","title":"بیشعوری در نتورک مارکتینگ","body":"<figure class=\"md-block-image md-block-image-has-caption\"><img src=\"https:\/\/files.virgool.io\/upload\/users\/48628\/posts\/ozaqqvtbgobu\/idgtzubn4sop.png\" alt=\"بیشعوری در نتورک مارکتینگ - با طعم خاویار کرمنت\" \/><figcaption className=\"md-block-image-caption\">بیشعوری در نتورک مارکتینگ - با طعم خاویار کرمنت<\/figcaption><\/figure><p class=\"md-block-unstyled\">سال ها بیشعوری در حوزه فروش محدود به کم فروشی و یا فروش جنس تقلبی و بدرد نخور بود. بیشعورهای فروشنده با چرب زبانی و وقاحت اجناس و خدمات مزخرف خود را به مشتریان نگون بخت می فروختند و پیش از اینکه مشتری فرصتی برای رو برگرداندن داشته باشد، ناپدید می‌شدند. تا اینکه تعدادی از بیشعورهای کله گنده متوجه شدند، <em class=\"md-inline-italic\"><strong class=\"md-inline-bold\">می‌شود با سازماندهی بعضی بیشعورها و ایجاد یک شبکه از بیشعورهای فروشنده به قدرت بیشتری رسید<\/strong><\/em>.<\/p><p class=\"md-block-unstyled\">نتورک‌های اولیه همان شبکه‌های هرمی بودند که عده ای پول می‌دادند و یک نفر پول‌ها را برمی‌داشت و با بقیه خداحافظی می‌کرد. بعدا بیشعورها متوجه شدند این سیستم زیادی ساده است و زود لو می‌رود. لذا تصمیم گرفتند مکانیزم‌های پیچیده‌تری از ریاضی‌دان‌ها قرض بگیرند.<\/p><p class=\"md-block-unstyled\">البته روش کار همیشه به نفع بیشعور زرنگ‌تر حفظ می‌شد ولی گاهی صحبت از یک محصول تخیلی از جنس طلا و پلاتینیوم به میان می‌آمد که مخاطبان را متعجب کرده و فریب می‌داد.<\/p><p class=\"md-block-unstyled\">امروز در کمتر کشوری نتورک مارکتینگ قانونی نیست. جورج مارتین از اعضای حزب کارگر در پارلمان می‌گوید: «به نظر من که نتورک مارکتینگ از کار کردن در معدن بهتر است. من هیچ وقت در معدن کار نکردم ولی ما این را قانونی می‌کنیم. چون به هر حال می‌شود مالیاتش را از کسانی که پولدار می‌شوند، گرفت. برای بقیه هم بالاخره یک سرگرمی است و نرخ بیکاری را پایین نگه می دارد.»  <\/p><p class=\"md-block-unstyled\">دکتر پاتریک زولمرویل پس از ۶ سال تحقیقات گسترده بر روی اعضای بیش از صد شرکت فعال در نتورک مارکتینگ در کتاب <strong class=\"md-inline-bold\">نتورک مارکتینگ یا بیشعوری مارکتینگ<\/strong>، چنین می‌نویسد:<\/p><blockquote class=\"md-block-blockquote\">حقیقتا شگفت آور است که تحلیل‌های آماری نشان می‌دهد احتمال بیشعوری رهبران شبکه های نتورک مارکتینگ با نسبت بیشعورهایی که در آن نتورک فعالیت دارند برابری می کند. <\/blockquote><p class=\"md-block-unstyled\">نتایج این تحقیقات البته دور از انتظار نبود. مشاهدات عینی نشان داده است بیشعوران نتورک‌ها در برابر افرادی که حاضر به ورود به مجموعه آن ها و خرید نباشند برخوردهایی وقیحانه، بی شرمانه و کاملا بدوی دارند.<\/p><p class=\"md-block-unstyled\">یک بیشعور-نتورک درمان شده پس از ۱۸ ماه قرنطینه در مرکز تخصصی بیشعور درمانی ماساچوست به پروفسور تامسون می گوید: <\/p><blockquote class=\"md-block-blockquote\">&quot;میزان خودشیفتگی و وقاحت خویش را روز به روز افزایش می دادیم. هدف خاصی نداشتیم و با چندر غاز پولی که بدست می آوردیم خودنمایی می کردیم و بقیه را وادار می کردیم در مورد آن در جلسات پرزنت صحبت کنند... ابدا به پس انداز اعتقادی نداشتیم. برای بدست آوردن اهداف جاه طلبانه مواد مصرف می‌کردیم و رپ گوش می‌دادیم...&quot;<\/blockquote><p class=\"md-block-unstyled\">لازم به ذکر است بیشعورهایی که در سطوح بالای نتورک مارکتینگ فعالیت‌ می کنند نسبت به ترویج بیشعوری و فراگیر شدن آن تلاش شگفت‌آوری از خود نشان می دهند. در جزوه های آموزشی یک نتورک منحل شده در اثر بیشعورزدگی گسترده می خوانیم:<\/p><blockquote class=\"md-block-blockquote\">مهم نیست فرد پرزنت شده چه می گوید، <strong class=\"md-inline-bold\">مهم این است که تا وقتی پول را از جیبش خارج نکرده اید ماموریت شما به پایان نرسیده است.<\/strong> سعی کنید حتمن او را به جلسات بعدی بکشانید. در این راه از هیچ تلاشی رویگردان نشوید. دروغ بگویید، داستان سرایی کنید. اگر به زبان خوش نیامد، اعضای خانواده ش را گروگان بگیرید. اگر تنها بود به خانه ش حمله کنید و جلسه را همانجا برگزار کنید! هیچ عذر و بهانه‌ای قابل پذیرش نیست.<\/blockquote><p class=\"md-block-unstyled\">از مواردی که در سیستم‌های نتورکی مستعد بیشعوری دیده می‌شود ترغیب اعضا به خریدهای مضاعف است. با توجه به ماهیت این سیستم‌ها اعضا موظف به خریدهای بیشتر هستند در غیر اینصورت مورد غضب واقع می‌شوند. در ادامه همان جزوه‌ای که ذکر آن رفت، چنین آمده است: <\/p><blockquote class=\"md-block-blockquote\">پس از اینکه یکبار خرید انجام شد آسوده نشوید و کار فروش را مثل چلاندن خمیردندان تکرار کنید و مطمئن شوید عضو جدید آه در بساط ندارد و مجبور به همکاری است، آنگاه او را به جان اطرافیانش بیاندازید تا آن ها هم از نعمت نتورک بی‌نظیر شما بی‌نصیب نمانند! <strong class=\"md-inline-bold\">هیچ وقت فراموش نکنید پورسانت شما در جیب اوست<\/strong>!<\/blockquote><p class=\"md-block-unstyled\"><br\/><\/p><p class=\"md-block-unstyled\">پرسش های این بخش:<\/p><ul class=\"md-block-unordered-list-item\"><li>آیا عضو یک نتورک هستید؟ چند بیشعور در رده های بالا سری خود می شناسید؟<\/li><li>آخرین باری که در مورد زندگی مرفه یکی از اعضای نتورکتان سخن گفتید کی بود؟<\/li><li>اخیرا کسی را پرزنت کرده اید؟ او موفق به فرار شد؟<\/li><li>در جلسات پرزنت سعی می‌کنید نتورکتان را عالی و بی‌نقص معرفی کنید؟ چرا؟<\/li><\/ul>","force_drafted":false,"updated_at":"۱ سال پیش"}],"userPostCounts":{"draftPosts":21,"publishedPosts":11}}